org/diary.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-01-17 Fri 22:10>
#+TITLE: Diary

* 日记

#+BEGIN_QUOTE
时间像头野驴，跑的飞快。生活需要计划、思考和沉淀。时空无限，人生终有尽时，想在这无限的时空中，舞动璀璨人生，就不能若无根的浮萍，随着光阴的长河漫无目的地漂流。
#+END_QUOTE

** [2020-06-05 Fri]

社会是很复杂的。社会上有形形色色的人有你看的惯的有你看不惯的。社会上也有许多形形色色的事，有你看的惯的，也有你看不惯的。其实你能控制的，只是你自己，你能控制你的思想，你能控制你的感受，你对自己的控制力越强，你就会变得越加强大。

保持自己的强大是很有必要的，它会在一定的条件下保证你受到公正公平的对待。你可以不去欺负别人，但是你也必须有足够的能力来确保自己安全无忧。有能力而不想去做的事，那是你的自由。想做却没有能力去做的事，那是一种无奈。多一点自由，少一点无奈，这就是惬意的人生。

人的一生其实是很短暂的，人活一辈子总要给以后留下点什么。滚滚历史的洪流上下几千年甚至几万年，究竟有多少人在历史的大潮中留下了他的身影？命运是很奇特的，光怪陆离，充满了无限的可能性。命运的小舟啊，你将要驶向何方？时代的巨轮啊，你将要形象何处？

继续力量成就自己的人生。

** [2020-06-04 Thu]

昨天的日记忘记写了……

看这就是习惯，习惯的事情你基本上会很少忘记，还没有形成习惯的就很容易忘记了。所以说，每一件事情都有两面性，有好的一面，也有坏的一面，幸运地是你可以利用这件事物好的一面，记住要辩证的看问题。那昨天忘了写日记，有没有它好的一面呢？好，或者不好，这是一个问题。

以后还是不要太放纵的好。就像这一次工作上的事情，中间“浪费”了好多时间。其实有很多事情是事先难于预料的，所以必须留够充足的时间去应对它们。

有付出才有收获，没有人能够随随便便成功，你必须积蓄足够的力量才可以。正所谓不经历风雨，怎能见彩虹？千里之行，始于足下。合抱之木，始于毫末。加油！

** [2020-06-02 Tue]

最近不知道怎么了，对工作的事总是不是很上心。项目进度总是一拖再拖，我这是怎么了？我难道不喜欢前端开发了吗？确实有一点吧！其实前端的技术站明明也有很多的，但是我总是感觉前端的东西好多都是浮于表面，大概是因为前端做的本来就是界面。另外还有一个重要的原因，我认为一个人如果只是沉浸在前端开发那么就失去了编程的真正意义，它就真正只成了一件谋生的工作了。如果现在你对前端开发真的没有兴趣了，那你就更应该抓紧时间去学学习后端知识，尽快的完善自己的技术栈，让自己成为一名合格的后端开发人员。我并不讨厌前端，但是如果只研究前端的话，并不能让你成为一个更好的前端开发人员。

有一种说法是程序员的鄙视链。但其实呢，你学习什么没有人去限制你，无论你现在从事的是哪一个方向，你都拥有自由的选择去在业余的时间学习你想要学习的知识。学习是一种思维方式，是一种能力。在这个过程中，你必须思考如何能更快、更好、更牢固地掌握你正在学习的东西。在学习一种东西的时候，知道这件事物现在的状况以及它的发展历程是非常非常重要的。尤其是发展的历程，因为每一件事物的出现都是有其原因的，而这些背后的原因才是真正推动这件事物不断发展的原动力。如果你不了解你现在所做的这些是为了什么，那么你就很难有动力去坚持下去。

唉，不管怎么说？我必须检讨一下，现在的工作态度了，毕竟现在领着公司的薪水，就应该把项目和工作做好。在做好完善自身工作的闲暇时间去最大程度的做自己喜欢的事，一方面可以对得起自己的良心，一方面可以对得起自己的兴趣。当然，最好的结果就是通过自己的努力，可以达到一定的程度，进而去创造自己喜欢的条件，去做自己最喜欢做的事情。我们活着就要为这个社会创造一定的价值，只有通过这种方式，我们才能实现人生的价值。对，是这样的，只有通过自身努力，你才能改变现状，你才能去主动地创造那些有利于你的条件，你才能享受你自己创造的条件进而去做你自己最喜欢做的事情，这样的话就是一个良性的循环。去做创造性的工作，远远要比做重复性的工作要来的让人兴奋和惬意。我们把繁杂的事物进行标准化流程化程序化不就是为了这样的目的吗？不就是为了把人们从繁杂重复造的劳动中解脱出来吗？那些劳动是有价值的，但是完全可以去做价值更高的事情，来让那些也具有价值的劳动变得不那么枯燥。对于工作这件事情需给自己定下几点原则，不给自己立个规矩也是不行的，这样每一天都沉浸在做自己的市场，而把公司的事情放在一边的话，是不太好的。工作的时间就用来做公司的事情，如果是工作的时间有所闲暇的话，那你要和做项目相关的事情，要去想着优化项目里面的某些点。因为在工作的时候，如果其余的一些时间你去做自己喜欢做的一些方面的话，那你很容易调整不过来自己的状态，从而把工作的时间过多地分给了自己喜欢的那些事。只有充分、优质地完成了本职的工作，你才会有心情去做自己喜欢的事，不然，你的心情并不如你自己想象的那么欣喜。

以此为证，工作的时间只做与工作相关的事情。下了班之后，你愿意做什么就做什么。Okay！

** [2020-06-01 Mon]

今天是六一童节，我决定从今年的下半年开始，每天都要写日记。尽管我可能写的是一些废话，但是还是要保持这个习惯吧。写日记的形式主要是通过语音输入，毕竟是日记嘛，对格式什么的也没有太大的要求。也许在第二天的时候我会进行一些修改，当然，也许不会修改。

时间过得真是太快了，不知不觉已经又半年过去了，从去年开始到今年真的是发生了很多事情，从中美贸易战到新型冠状肺炎，世界形势也变化的是很快，我感觉自己的思想也发生了很大的改变。

人们是应该做自己喜欢的事情的，兴趣是最好的老师，这一点是真的。在你做自己感兴趣的事情的时候，你会以这个为中心往外不断的扩展。万物是相通的，举一反三源于对于本质的思考。再次强调一下，人的精力和时间，真的是有限的，我们应该把时间和精力用在最应该用的地方。保持经历的最好办法还是要遵循极简主义生活方式。

你的目标也许很宏大，但是总还是要分阶段来做的。你不可能在一天之内就把所有的事情做完，正如矛盾分为主要矛盾和次要矛盾，事情也是分轻重缓急的，你应该做最重要，而且紧急的事情。至于那些不重要，且不紧急的应该放在稍后的位置。有时候我们应该认真思考一下自己先前的一些观念，到底是不是正确的？也许好多时候我们自以为正确的事情往往错的离谱。

抓紧时间提高自己摆脱债务陷阱是一件非常非常非常重要的事情。不要给自己设限，要让自己的精神和身体，形成一种良性的循环。你知道的，有些事当你懂了，你自然就懂了。你知道的，自欺欺人是很简单的，我们在很多时候都可以给自己找一个理由。

今天是儿童节，是一个不错的开始。从今天开始，加强滋养自己的精神锻炼自己的身体，保持精神的富足，保证身体的强健，进而拥有更多的经济和时间去做你想要做的事情。在2020年5月的最后一天，申请了一个自己也比较满意的域名，这个域名我会一直使用下去。它是浪漫的，有意义的。给自己一个新的开始，给生活一个新的开始。对，有开始，就有希望。

加油，自己。加油，生活。

乱糟糟的语言也没有组织就说这些吧。

** [2020-05-01 Fri]

白天写日记，这不算是头一遭，不过也是不多……

五一长假来了，有五天的集中时间可以做一此事情，读完放在角落吃灰的书，学习新的语言，写几篇博客，录制几段视频，学习一下视频剪辑的软件…… 会发现要做的事很多，而你的时间和精力是有限的，所以当务之急还是要把琐碎的知识管理规范起来。如何去做呢？

以 GTD 为主架构，各个阶段中采用最佳管理方法，GTD 最大的优势就是它应收尽收的能力和思想，它如同一个平台，给了其它方法合适的嵌入点。

** [2020-03-16 Mon]

生活中，许多习以为常的概念，自以为明白，尝试去详细描述的时候，头脑中却往往是一片空白，生活因而显得繁杂无序，没了条理。思之不明，故述之不详，然大道至理常存于这看似的平淡无奇之中。

** [2020-02-28 Fri]

为什么会拖延呢？已经安好了计划，也知道事情是必须要处理的，但是为什么迟迟没有动手呢？不感兴趣，且短时间内无法完成，也有 _担心是否可以顺利完成_ 而心中存在疑虑的因素！焦虑便是这样产生的！

#+BEGIN_QUOTE
焦虑是由于缺乏控制力，组织管理、准备和行动不足所造成的。
#+END_QUOTE

控制力，本质上来说是一种习惯，而习惯都是可以培养的。而且培养一种好习惯，收效是很客观的，养成一种好习惯的同时，不仅仅意味着拥有了更好的生活方式，同时标志着减少了该方面原本存在的恶习。好习惯的培养带来的回报是指数级增长的，一个好习惯会全方位地带动其他方面的提升。

执行力！再光辉的思想无法应用于实践过程中，也不过是屠龙之术。说破了天，还是要做！做！做！

孔夫子说，“学而不思则罔，思而不学则殆”。世间诸般事，不外如是啊。 GTD ，目前算是只学了一些皮毛，初窥门径而已，当务之急，是先要用起来，认真仔细地思考一下其运行规则。执行！执行！执行！

