org/diary.org
** [2020-02-26 Wed]

#+BEGIN_QUOTE
我们曾如此渴望命运的波澜，到最后才发现：人生最曼妙的风景，竟是内心的淡定与从容。我们曾如此期盼外界的认可，到最后才知道：世界是自己的，与他人毫无关系。 -- 杨绛
#+END_QUOTE

人的一生，有多少个阶段？一个人，直面审视自己的内心，需要多大的勇气？

这十年，塔内塔外各半，酸甜苦辣皆含。时至今日，袖裳空空，脑海乏乏，唯余二三烦扰事于心。诸事不遂，皆有因果，竹篮打水，更如梦幻泡影。掖着藏着，文过饰非，羞于心，愧对己，不得潇洒，反而若鼹鼠无目，不见终日而惶惶。无私为私，彼心不古，乃势，所谓势不可挡，局中求破局而功者，知造势、顺势，假于人物也。

过往的十年，可以称为假寐岁月，成长的波澜淙淙，流淌着无知、愚昧，唯美、善真。也是随波逐流的十年，没有风帆的舵手，顺流而下，或触礁跌宕，或风暴骤降。命运的光怪陆离，幸运的矫揉造作，无妄、无名。少年登楼望月赋怨愁，月依旧，那份安然、刻意在心头。

生活啊，是乱成了一团麻，需要有意识地去管理，需要克制，需要自律，这是一件苦差事，得失总归在平衡，平衡却又不同。忘却自己，模糊了前路，便容易变成真的糊涂，浪费了青春和岁月。心灵的刚强与脆弱，得意的春风，老树和昏鸦。

十年不知措，施于何为？心智苦矣，筋骨劳矣，体肤饿矣，大任乎？也可能只是徒然四壁，夜雨屋漏而已。由内而外，反求诸己，方是正道，所谓自助者天助，君子当自强不息，不外如是。反思、咀嚼那些苦楚，不可名，不可道，唯有心知。

十年来，恶习不绝，知而不改，掘墓无数，终须大毅力补之。时间一分一秒，本无不同，那些有意义的刻钟，定格凝固，皆心使之异众。记忆是一个复杂的结构，记起、忘记，片段支离。读书和工作，书读的浅浅薄薄，事做的马马虎虎。幸哉处，几本佳作以筑，稍宽慰心胸，免于俗不可耐，浑身恶臭。

探索事物的本质和原理是一种乐趣，大道本一，殊途同归。稻盛和夫，《活着》精进，精进是核心，绝非是一味机械的重复。事物的对立面不是相距千里，往往只在一念之间。史蒂芬·柯维，《七个习惯》相辅相成，积极主动、以终为始、要事第一，从依赖到独立；双赢思维、知彼解己、综合综效，又从独立到依赖；不断更新，平衡自我。朗达·拜恩，揭露《秘密》，宇宙无限，频率共振，身心合一，量子吸引。大卫·艾伦，《无压力生活》，心如止水，循环集成。《易》以盖之，天地定位，山泽通气，雷风相薄，水火不相射。《道德经》注，无中生有，有生万物，道法自然，大象无形。极简生活，少即是多，求质清心。

何以成就？

难得糊涂？中国文化的妙处就在这里，同一个词语，多重含义，不同层级，不容意义，有时甚至是截然相反的。或许，司空见惯的事，耳熟能详的话，所理解的和它们真正要表达的南辕北辙。就拿“糊涂”一词作比，天然就裹挟着真糊涂和假糊涂两个意思，每种又同时包含褒贬二义。倒不是，引经据典的人闲来无事，故意掉书袋，实则事实如此，诸事不一而同。《老子》说，“道生一，一生二，二生三，三生万物。”以这个假定为基础，不难看出，万物同宗同源，皆生于道。何为道？《老子》曰，“道可道，非常道。”认为道是玄而又玄，不可名状的，任何具象化的道都不是道的本质，正所谓大象无形。道之为道，上善若水，利万物滋众生，在于浩瀚星数，处于毫微有间，无所不容，无处不存。

四书五经。四书，《大学》、《中庸》、《论语》、《孟子》。五经，《诗经》、《尚书》、《礼记》、《周易》、《春秋》。

《大学》开篇有云，“知止而后有定；定而后能静；静而后能安；安而后能虑；虑而后能得。物有本末；事有终始。知所先后，则近道矣。”故须格物致知，“致知在格物，物格而后知至；知至而后意诚；意诚而后正；心正而后身修”，身修继而齐家治国平天下。

愈读之，愈度之，愈叹服。

观当下国内的教育系统有感，四字可盖之，“急功近利”！止时不教定，定时不明静，静时不能安，安时不思虑，而又苦其不能得。置正途而不顾，百思其捷，欲速欲达，竭泽而渔。何以至于此？本末倒置使然。何以成就？当固本清源，因时而动。

用现代的思考来说，无论是极简主义思潮，还是 GTD 安排，最终的目的，都是理清事物的脉络，知止求定利静益虑而得。我们呢？端着金碗要饭。这些先辈圣贤千年前就想明白的道理，却被我们束之高阁，装点门面，而失之精华。应该从自身出发，由内而外，反求诸己。应该发现并思考事物之间的联系，应该循环往复，使之生生不息，不塞滞。深思熟虑，上通下达，水到渠成，何以不得？何以不就？！

** [2020-02-22 Sat]

哎呀，这恼人的拖延症！

#+BEGIN_QUOTE
拖延 → 焦虑
#+END_QUOTE

为什么会拖延呢？浮躁。拖延，可以让你不用面对，是一种潜在的懦弱。有许多，心知肚明应该要做的事情没有去做，而坏习惯带来的无用之事却占据了大部分的精力和时间，要么紧迫，要么事倍功半，总之是一种恶性循环的得不偿失。

如何解决拖延呢？由内而外，反求诸己。简，精神极简，物质极简。思，诚意正心，剔糟除粕。行，贵不自欺。

** [2020-02-17 Mon]

内化，持续。

#+BEGIN_QUOTE
不积跬步，无以至千里；不积小流，无以成江海。
#+END_QUOTE

一日之时有限，诸事巨细，多则非一日一时可全之。一事之道，穷根溯理，亦非须臾可得之。故恒，要也。

很多年以前，便有写一本小说的想法，也有过开头，多数都是止步千字，便无疾而终了。凡事，谋定而后动，但多数时候，是不可能万事俱备的，很多事情本来就是运行时，只有先动起来，才会达到成熟的时机。每天的时间和精力都是有限的，所以合理的分配使用便很重要。

如上诸般，归根到底，还是要 _恒_ 。

要有目标，否则，便容易迷失，必不可持久。所谓，立志当高远，非让人好高骛远、不切实际、浮躁不实。高远者，始为混沌，欲觅之，必拨云开雾，于人，则是察己之道、观世之道。高远者，虽云遮雾绕，弥于目却不盖于心，以心视之，如中天之日，若当空皓月。所谓，路漫漫其修远兮，途中难免风餐露宿，虚心空腹，以锻其志，增益其心。

#+BEGIN_QUOTE
人生数十载，不觉而立年。须臾思过弥，念至简非繁。
#+END_QUOTE

高远者，终生之志也。凡人，自非先知之辈，世间又几多先知之士。我们无法看到生前身后事，却可活在当下。凡事，预则立，不预则废。预者，思之在前，贯同始末。

#+BEGIN_QUOTE
道生一，一生二，二生三，三生万物。
#+END_QUOTE

万物有道，象繁质简，简而非易，为有序也。故思，存道于心，萃之炼之，以修身性。

思考的重要性，其实不必言说，每个人都会有所思、有所悟。可以思考，是一件多么幸运的事情，它是整个精神世界革新的驱动力。要有所成就，便不能怠思倦考，像鸵鸟一样，把脑袋埋于土沙下，是没有什么益处的。

** [2020-01-30 Thu]

#+BEGIN_QUOTE
逝者如斯夫，不舍昼夜。
#+END_QUOTE

不知不觉间，一月份已经快要过完了。意诚、心正、身修。

** [2020-01-25 Sat]

能屈能伸，方为大丈夫也。

** [2020-01-24 Fri]

火车站差点摔了跤，汽车站差点碰了头，回家之后为三只小二哈和团团狗仔服务了一个半小时，嗯，除夕快乐 ^_-||

** [2020-01-21 Tue]

家事，琐事，天下事，事事关心。

爱情，友情，人间情，情情留意。

** [2020-01-20 Mon]

一切不过“数、理、象” 。

** [2020-01-19 Sun]

解析几何 → 数、理、象？易经，无处不在！

** [2020-01-18 Sat]

#+BEGIN_QUOTE
合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。
#+END_QUOTE

** [2020-01-17 Fri]

#+BEGIN_QUOTE
劝君莫惜金缕衣，劝君须惜少年时。\\
有花堪折直须折，莫待无花空折枝。
#+END_QUOTE

** [2020-01-16 Thu]

今日，心神有些不宁，源自何起，奈何？奈何？

** [2020-01-14 Tue]

模块化和组件化在软件工程中是不可或缺的。编程语言和各种架构，工具性大于思想性。编程的本质到底是什么呢？是对现实生活系统的抽象。生活给人的印象往往是杂乱无章的，其实不然，生活是“乱”中有 _序_ 的。编程要实现对于生活的复刻，就必须抓住其中的序。如何做呢？漫无目的，从头踩坑无疑是极度愚蠢的做法，毕竟站在巨人的肩膀上才能看的更远。什么是 _编程中的序_ 呢？路漫漫其修远兮，吾将上下而求索。

** [2020-01-13 Mon]

知识的深度和广度。

** [2020-01-12 Sun]

我这一生，到底能达成什么成就呢？人生路漫漫，前途几何？这已经成为了一个迫在眉睫的事情，容不得我不认真思考了。

有一种力量，是每个人都与生俱来的，它需要正确地引导，否则必不可持久。如何牵引这股力量呢？如何呢？如何呢？

#+BEGIN_QUOTE
大学之道，在明明德，在亲民，在止于至善。知止后有定，定而后能静，静而后能安，安而后能虑，虑而后能得。物有本末，事有终始，知所先后，则近道矣。古之欲明明德于天下者，先治其国，欲治其国者，先齐其家；欲齐其家者，先修其身；欲修其身者，先正其心；欲正其心者，先诚其意；欲诚其意者，先致其知，致知在格物。物格而后知至，知至而后意诚，意诚而后心正，心正而后身修，身修而后家齐，家齐而后国治，国治而后天下平。自天子以至于庶人，壹是皆以修身为本。其本乱而末治者，否矣。其所厚者薄，而其所薄者厚，未之有也。此谓知本，此为知之至也。所谓诚其意者， _毋自欺也_ 。如恶恶臭，如好好色，此之谓自谦。故君子必慎其独也。小人闲居为不善，无所不至，见君子而后厌然，拼其不善，而著其善。人之视己，如见其肝肺然，则何益矣。此谓诚于中形于外。故君子必慎其独也。
#+END_QUOTE

** [2020-01-11 Sat]

尝试，勇敢地去尝试。

** [2020-01-10 Fri]

#+BEGIN_QUOTE
红藕香残玉簟秋。轻解罗裳，独上兰舟。\\
云中谁寄锦书来？雁子回时，月满西楼。\\
花自飘零水自流。一种相思，两处闲愁。\\
此情无计可消除，才下眉头，却上心头。

-- 宋代·李清照《一剪梅》
#+END_QUOTE

#+BEGIN_QUOTE
明月多情应笑我，笑我如今。辜负春心，独自闲行独自吟。\\
近来怕说当时事，结遍兰襟。月浅灯深，梦里云归何处寻。

-- 清代·纳兰性德《采桑子》
#+END_QUOTE

#+BEGIN_QUOTE
风絮飘残已化萍，泥莲刚倩藕丝萦。珍重别拈香一瓣，记前生。\\
人道情多情转薄，而今真个不多情。又到断肠回首处，泪偷零。

-- 清代·纳兰性德《山花子》
#+END_QUOTE

** [2020-01-09 Thu]

对事物的认知是一个渐进的过程，在迷惑和解惑的循环中逐渐了解事物的本质。一个人，无论是笨蛋，还是天才，都必须经过这个过程。相对而言，天才只是可能走的更快些，笨蛋则会慢一些。但是不是快了就一定好呢？慢了就一定不好呢？这些东西都是相对的。宇宙的一切事物都是平衡的，每个人都会在生命的历程中收获属于他自己的精彩。

** [2020-01-08 Wed]

《易经》，神奇的经典。

** [2020-01-07 Tue]

2020 年的第七天，感冒中……

我这身体啊，都快锈掉了…… 再不锻炼，估计要提前迈入中年危机了。天人合一，精神和物质的融合，生命便是两者的载体。请爱惜身体，敬畏生命。

** [2020-01-06 Mon]

凡事，预则立，不预则废。满招损，谦受益。了解自己，保持清醒，且不可得意忘形，忘乎所以。

** [2020-01-05 Sun]

前几天，那么多的废话，也逃不出 _变易、简易、不易_ 。人傻就要多读书，先辈诚不欺我也。

