org/diary.org
** [2020-01-04 Sat]

计划！为什么需要计划？时间有限，光阴不可逆，高效地利用时间去做合理的事情就显得十分迫切和重要。

知行合一，何为知，何为行？从某个角度而言，知和行其实是理论和实践的一种平衡。重理论，轻实践，便不能很好地检验理论地正确性，仿若把自身置于空中楼阁。重实践，轻理论，也会有南辕北辙撞南墙的下场。知行的平衡便在于，两者的的作用是相互的。

工作中，不能一味地沉浸在解决边角料，那样不利于自身理论体系的建立，也不能抵触排斥，因为它本身也是对理论体系的补充和验证。理论体系的建立，不是主观臆想而来的，它是我们自身的实践，和观察别人的实践过程，所获取的直接、间接的认识内化形成的。

为什么需要计划呢？人生苦短。这一生，要实现什么？这大概是一个人的终极目标了。空泛地追求无限是没有意义的，了解局限是实际的做法，有时候甚至需要人为的去设置边界。拿计划来说，日计划、月计划、季计划、年计划、三年计划、五年计划、十年计划等，用时间来做边界。不做限制，没有边界，是很空洞的。如同给你一张大若天际的白纸，你反而不知道如何涂抹了。反而不若裁剪开来，反而容易成其全貌。

不能闭门造车，多读书，多读经典，没有错的。

** [2020-01-03 Fri]

一般都是八点四十起床，偶尔六点醒一次，一天就朦胧过去了……

习惯的力量！所谓，君子生非异也，善假于物也。也许意识是无限的，但躯壳是受限的。观察现象，探寻规律，顺势而为，用无形的手，引导动的弦。不以物喜，不以己悲。哎，古人的智慧，浩瀚如沧海。历史，反复而曲折，今朝的落日，千年之前的夕阳。既有道，生于忧患，死于安乐。又谓，闲看落花，不着风云动，卷舒随心。

愿静思、冥想，得一二，砥砺前行，不负韶华。这个周末，好好地规划一下 2020 ，千里之行，由足下始。光阴似箭，时不我待，一万年太久，只争朝夕。

** [2020-01-02 Thu]

羞于笔触，腹内空空。生了锈的指尖敲击，脑海中的混沌。非得无处着手，奈何点墨不足于胸。

想来，事物的本质，往往是简而有理的，许多常态化的细枝末节往往是后来人释注而已。古语云，读万卷书，行万里路，私以为，便是应了那句“纸上得来终觉浅，绝知此事要躬行”。做学问，一味地道听途说，不可取。求索真理的漫漫长途中，不求甚解更要不得。细想来，书中多有谬误，曾阅一事，说是诸葛孔明读书只了了数观，便弃之高阁，不求甚解。用来表达的是，读书不要那么认真，不要寻根究底。每每思起，莫不要让人笑掉大牙了。思来，应是丞相腹有经纶，对于一些斧凿之作，略睹便知其意罢了。

** [2020-01-01 Wed]

2020 的第一天。

